In [1]:
import pandas as pd

file_path = 'train.csv'
df = pd.read_csv(file_path)

print("Первые 5 строк датасета:")
df.head()

Первые 5 строк датасета:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
missing_values = df.isnull().sum()

print("Количество пропущенных значений в каждом столбце:")
print(missing_values)

Количество пропущенных значений в каждом столбце:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [3]:
age_median = df['Age'].median()
print(f"Медианный возраст: {age_median}")

df['Age'] = df['Age'].fillna(age_median)

Медианный возраст: 28.0

In [4]:
embarked_mode = df['Embarked'].mode()[0]
print(f"Самый частый порт посадки: {embarked_mode}")

df['Embarked'] = df['Embarked'].fillna(embarked_mode)

Самый частый порт посадки: S

In [5]:
df = df.drop('Cabin', axis=1)
print("Столбец 'Cabin' удален.")

Столбец 'Cabin' удален.

In [8]:
print("\nКоличество пропущенных значений после заполнения:")
print(df.isnull().sum())

Количество пропущенных значений после заполнения:
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [7]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

columns_to_normalize = ['Age', 'Fare']

df[columns_to_normalize] = scaler.fit_transform(df[columns_to_normalize])

print("Датасет после нормализации столбцов 'Age' и 'Fare':")
df.head()

Датасет после нормализации столбцов 'Age' и 'Fare':

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,0.271174,1,0,A/5 21171,0.014151,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,0.472229,1,0,PC 17599,0.139136,C
2,3,1,3,"Heikkinen, Miss. Laina",female,0.321438,0,0,STON/O2. 3101282,0.015469,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,0.434531,1,0,113803,0.103644,S
4,5,0,3,"Allen, Mr. William Henry",male,0.434531,0,0,373450,0.015713,S

In [15]:
cols_to_drop = ['Name', 'Ticket', 'PassengerId']
df = df.drop(columns=[c for c in cols_to_drop if c in df.columns])
print(df.columns.tolist())

['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Sex_male', 'Embarked_Q', 'Embarked_S']

In [17]:
df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,0,3,0.271174,1,0,0.014151,True,False,True
1,1,1,0.472229,1,0,0.139136,False,False,False
2,1,3,0.321438,0,0,0.015469,False,False,True
3,1,1,0.434531,1,0,0.103644,False,False,True
4,0,3,0.434531,0,0,0.015713,True,False,True